spisok = [1, 'января', '2021', 'абырвалг']

if type(spisok[0]) == int:
    print('Тип данных первого элемента в списке верен')
else:
    print('ОШИБКА ТИПА ДАННЫХ ПЕРВОГО ЭЛЕМЕНТА В СПИСКЕ')

if type(spisok[1]) == str:
    print('Тип данных второго элемента в списке верен')
else:
    print('ОШИБКА ТИПА ДАННЫХ ВТОРОГО ЭЛЕМЕНТА В СПИСКЕ')

if type(spisok[2]) == int:
    print('Тип данных третьего элемента в списке верен')
else:
    print('ОШИБКА ТИПА ДАННЫХ ТРЕТЬЕГО ЭЛЕМЕНТА В СПИСКЕ')

if type(spisok[3]) == int:
    print('Тип данных четвёртого элемента в списке верен')
else:
    print('ОШИБКА ТИПА ДАННЫХ ЧЕТВЁРТОГО ЭЛЕМЕНТА В СПИСКЕ')